# 1. Используем официальный образ Golang для сборки
FROM golang:1.23 AS builder

# 2. Устанавливаем рабочую директорию в контейнере
WORKDIR /App

# 3. Копируем все файлы проекта в контейнер
COPY . .

# 4. Загружаем зависимости и компилируем бинарник
RUN go mod tidy
RUN go build -o main ./cmd/complaints

# 5. Используем минимальный образ для финального контейнера
FROM debian:bullseye-slim

# 6. Обновляем репозитории и устанавливаем необходимые зависимости
RUN apt-get update && apt-get install -y \
    wget \
    libc6 \
    && apt-get clean

# 7. Устанавливаем рабочую директорию
WORKDIR /App

# 8. Копируем скомпилированный бинарник
COPY --from=builder /App/main .

# 9. Открываем порт (например, 8080)
EXPOSE 5053

# 10. Запускаем бинарник при старте контейнера
CMD ["./main"]
